tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Terminal Client for Redis with AutoCompletion and Syntax Highlighting
brew "iredis"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Video chat, voice call and instant messaging application
cask "skype"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Bear", id: 1091189122
mas "Snappy", id: 512617038
